# NPerM Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..NPerM Property
SymbolTypeId Class See Also
---
Symbol N/m, indicating unit Newtons per meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId NPerM { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NPerM As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ NPerM {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace